## Data Wrangling

## Tiny Data

A foundation for wrangling in pandas

![](images/pandas_tiny_data.png)

## Create DataFrames

**Specify values for each column**

In [1]:
import pandas as pd

df = pd.DataFrame({
    "a": [4, 5, 6],
    "b": [7, 8, 9],
    "c": [10, 11, 12]
}, index=[1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

**Specify values for each row**

In [2]:
df = pd.DataFrame(
    [[4, 5, 6],
    [7, 8, 9],
    [10, 11, 12]],
    index=[1, 2, 3],
    columns=["a", "b", "c"])
df

    a   b   c
1   4   5   6
2   7   8   9
3  10  11  12

**Create DataFrame with a MultiIndex**

In [3]:
df = pd.DataFrame({
  "a": [4, 5, 6],
  "b": [7, 8, 9],
  "c": [10, 11, 12]
})
index = pd.MultiIndex.from_tuples(
  [('d', 1), ('d', 2), ('e', 2)],
  names=['n','v'])
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

## Reshaping Data

### melt

“Unpivots” a DataFrame from wide format to long format, optionally leaving identifier variables set.

In [4]:
import pandas as pd

df = pd.DataFrame({
    "a": [4, 5],
    "b": [7, 8],
    "c": [10, 11]
})
df

   a  b   c
0  4  7  10
1  5  8  11

In [5]:
pd.melt(df)

  variable  value
0        a      4
1        a      5
2        b      7
3        b      8
4        c     10
5        c     11

### pivot

Reshape data (produce a “pivot” table) based on column values. Uses unique values from index / columns to form axes of the resulting DataFrame.

In [6]:
df = pd.DataFrame({'foo': ['one','one','one','two','two','two'],
                       'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                       'baz': [1, 2, 3, 4, 5, 6]})
df

  bar  baz  foo
0   A    1  one
1   B    2  one
2   C    3  one
3   A    4  two
4   B    5  two
5   C    6  two

In [7]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [8]:
df.pivot(index='foo', columns='bar')['baz']

bar  A  B  C
foo
one  1  2  3
two  4  5  6

### concat

Append rows of DataFrames

In [9]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
               columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [10]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                  columns=['letter', 'number'])

In [11]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Append columns of DataFrames

In [12]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                  columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [13]:
df2 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])
df2

   animal    name
0    bird   polly
1  monkey  george

In [14]:
pd.concat([df1, df2], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

### sort

In [35]:
df = pd.DataFrame([['a', 10, 1], ['b', 10, 5], ['c', 30, 3]],
                  columns=['name', 'age', 'score'])
df

  name  age  score
0    a   10      1
1    b   10      5
2    c   30      3

order rows by values of a column (low to high)

In [36]:
df.sort_values('age')

  name  age  score
0    a   10      1
1    b   10      5
2    c   30      3

order rows by values of a column (high to low)

In [37]:
df.sort_values('age', ascending=False)

  name  age  score
2    c   30      3
0    a   10      1
1    b   10      5

order rows by values of two column

In [40]:
df.sort_values(['age', 'score'], ascending=[False, False])

  name  age  score
2    c   30      3
1    b   10      5
0    a   10      1

sort the index of a DataFrame

In [44]:
df.sort_index()

  name  age  score
0    a   10      1
1    b   10      5
2    c   30      3

Reset index of DataFrame to row numbers, moving index to columns

In [46]:
df.reset_index()

   index name  age  score
0      0    a   10      1
1      1    b   10      5
2      2    c   30      3

### drop

drop columns from DataFrame

In [49]:
df.drop(['age', 'score'], axis=1)

  name
0    a
1    b
2    c